[
  {
    "episode": 278,
    "title": "Ikitai to Ie! Oretachi wa Nakama Da!!",
    "plot": "Since she was 8, Robin's life has been a constant struggle to survive. Everybody has told her that her existence was a crime, and now Luffy begs her to stay alive.",
    "releaseDate": "Sun, Sep 24, 2006",
    "rating": 9.6
  },
  {
    "episode": 312,
    "title": "Arigatou Merry! Yuki ni Kemuru Wakare no Umi",
    "plot": "The crew must finally say goodbye to their ship merry.",
    "releaseDate": "Sun, Jun 3, 2007",
    "rating": 9.6
  },
  {
    "episode": 377,
    "title": "Nakama no Itami wa Waga Itami: Zoro Kesshi no Tatakai",
    "plot": "Zoro tries to stop Kuma from killing Luffy and Kuma offers Zoro a deal, he can take away Luffy's pain but he has to implant it in Zoro instead. Kuma tells him that he could die from all the pain but Zoro accept the offer without hesitation.",
    "releaseDate": "Sun, Nov 16, 2008",
    "rating": 9.6
  },
  {
    "episode": 405,
    "title": "Kesareta Nakama-tachi: Mugiwara Ichimi Saigo no Hi",
    "plot": "Sentomaru reveals that Kuma has the ability to make people fly through the sky to far away places.",
    "releaseDate": "Sun, Jun 14, 2009",
    "rating": 9.6
  },
  {
    "episode": 482,
    "title": "Hi o mo Yaki Tsukusu Chikara: Akainu Hijou no Tsuigeki",
    "plot": "Whitebeard aims to take down the whole of Marineford and orders his crew and the other pirates to flee.",
    "releaseDate": "Sun, Jan 9, 2011",
    "rating": 9.6
  },
  {
    "episode": 726,
    "title": "Gear Fourth! Kyoui no Bounce Man!",
    "plot": "Luffy casts off his sandals and activates Gear Fourth. His body changes with a ballooned torso covered with tribal like markings and coated with Busoshoku Haki.",
    "releaseDate": "Sun, Jan 17, 2016",
    "rating": 9.6
  },
  {
    "episode": 1015,
    "title": "Straw Hat Luffy! The Man Who Will Become the King of the Pirates!",
    "plot": "Yamato reveals her dream to Ace in a flashback. Meanwhile Luffy, Zoro, Law, Kidd and Killer confront Kaido and Big Mom on the rooftop.",
    "releaseDate": "Sun, Apr 24, 2022",
    "rating": 9.6
  },
  {
    "episode": 1062,
    "title": "The Three-Sword Style of the Supreme King! Zoro vs. King",
    "plot": "As the battle between Zoro and King reaches its climax, Zoro, after figuring out the secret of King's abilities, uses his newfound power to create the King of Hell Three Sword Style.",
    "releaseDate": "Sun, May 21, 2023",
    "rating": 9.6
  },
  {
    "episode": 236,
    "title": "Luffy VS Usopp! Butsukaru Otoko no Iji",
    "plot": "The most terrible fight begins and Usopp has prepared some tricks to fool Luffy, but the strength of the captain is clear. Memories go back and forth while even Merry is crying.",
    "releaseDate": "Sun, Jun 19, 2005",
    "rating": 9.5
  },
  {
    "episode": 309,
    "title": "Kobushi ni Kometa Omoi! Luffy Konshin no Gatling",
    "plot": "\"Luffy Vs Lucci: The Final Round\". On the Hesitation Bridge, Zoro and rest of The Straw Hat Crew engage marines.",
    "releaseDate": "Sun, May 13, 2007",
    "rating": 9.5
  },
  {
    "episode": 396,
    "title": "Tekken Sakuretsu! Auction o Buttsubuse",
    "plot": "The auction continues, but Saint Charlos arrives and ruins the Straw Hats' plan to buy Camie back by placing an exorbitant bid on her.",
    "releaseDate": "Sun, Apr 12, 2009",
    "rating": 9.5
  },
  {
    "episode": 404,
    "title": "Taishou Kizuru no Moukou Mugiwara Ichimi Zettaizetsumei!",
    "plot": "Usopp and Brook's attempt to attack Kizaru and save Zoro's life failed.",
    "releaseDate": "Sun, Jun 7, 2009",
    "rating": 9.5
  },
  {
    "episode": 480,
    "title": "Sorezore no Eranda Michi: Luffy vs Garp!",
    "plot": "Luffy unwillingly hits Garp, who is blocking his way to Ace. As Garp falls, the bridge crumbles.",
    "releaseDate": "Sun, Dec 19, 2010",
    "rating": 9.5
  },
  {
    "episode": 481,
    "title": "Ace Kyuushutsu! Shirohige Saigo no Senchou Meirei!",
    "plot": "Ace is freed at last as he and Luffy fight their way back to escape from Marineford.",
    "releaseDate": "Sun, Dec 26, 2010",
    "rating": 9.5
  },
  {
    "episode": 483,
    "title": "Kotae o Sagashite: Hiken Ace Senjou ni Shisu",
    "plot": "An eerie silence falls over the battlefield as Luffy and Ace share a heartbreaking final moment together.",
    "releaseDate": "Sun, Jan 16, 2011",
    "rating": 9.5
  },
  {
    "episode": 484,
    "title": "Kaigun Honbu Houkai! Shirohige Kotobanaki Ikari!",
    "plot": "Luffy's has a breakdown due to the emotional trauma of Ace's death, causing Jinbe to take him away.",
    "releaseDate": "Sun, Jan 23, 2011",
    "rating": 9.5
  },
  {
    "episode": 485,
    "title": "Kejime o Tsukeru: Shirohige vs Kurohige Kaizokudan",
    "plot": "Blackbeard and his pirates arrive in Marineford, as they are taken down from the execution platform by Whitebeard.",
    "releaseDate": "Sun, Jan 30, 2011",
    "rating": 9.5
  },
  {
    "episode": 488,
    "title": "Hisshi no Sakebi: Unmei o Kaeru Yuuki Aru Suubyou",
    "plot": "The fight in Marineford still rages on, as Trafalgar Law arrives to rescue Luffy.",
    "releaseDate": "Sun, Feb 20, 2011",
    "rating": 9.5
  },
  {
    "episode": 489,
    "title": "Shanks Kenzan! Choujou Sensou Tsui ni Shuuketsu",
    "plot": "Law and his crew take Jinbe and Luffy inside their submarine.",
    "releaseDate": "Sun, Mar 6, 2011",
    "rating": 9.5
  },
  {
    "episode": 706,
    "title": "Yuke Law: Yasashiki Otoko Saigo no Tatakai!",
    "plot": "After recalling how he killed his father and met his executives as a child, Donquixote Doflamingo confronts his brother, Rosinante.",
    "releaseDate": "Sun, Aug 23, 2015",
    "rating": 9.5
  }
]