[
  {
    "episode": 336,
    "title": "Shutsudou Chopperman! Mamore Nagisa no TV-kyoku",
    "plot": "The adventures of Chopperman the hero and his battle against evil Usodabada.",
    "releaseDate": "Sun, Dec 23, 2007",
    "releaseYear": 2007,
    "rating": 5.2
  },
  {
    "episode": 492,
    "title": "Saikyou Tag! Funtou, Luffy to Toriko!",
    "plot": "After eating the Hungrila Bird that they captured, Luffy and Toriko team up again to save Nami and Komatsu who have been kidnapped by the Cocoalas.",
    "releaseDate": "Sun, Apr 3, 2011",
    "releaseYear": 2011,
    "rating": 5.5
  },
  {
    "episode": 542,
    "title": "Team Kessei! Chopper o Sukue",
    "plot": "Toriko and Komatsu are seen fishing when Komatsu catches a Harusame. After defeating it, Luffy suddenly comes out of the Harusame's mouth and surprises Toriko and Komatsu.",
    "releaseDate": "Sun, Apr 8, 2012",
    "releaseYear": 2012,
    "rating": 5.6
  },
  {
    "episode": 590,
    "title": "Jijou Saikyou Colabo VS Umi no Taishokukan",
    "plot": "Featured characters of One Piece, Toriko, and Dragon Ball Z enter the IGO tournament in order to gain the Carat meat, which is said to be the most tasteful in the world. However, it leads in a tie between Goku, Toriko, and Luffy.",
    "releaseDate": "Sun, Apr 7, 2013",
    "releaseYear": 2013,
    "rating": 5.6
  },
  {
    "episode": 292,
    "title": "Oshiro de Mochimaki Dai Race! Akai Hana no Inbou",
    "plot": "The Great Mochimaki Race, a festival about who can catch a Mochimaki with a great treasure inside, is running, but Buggy has a conspiracy for stealing the treasure before the festival starts.",
    "releaseDate": "Sun, Jan 7, 2007",
    "releaseYear": 2007,
    "rating": 5.7
  },
  {
    "episode": 406,
    "title": "Jidaigeki Tokubetsu Hen: Luffy Oyabun Futatabi Kenzan",
    "plot": "In an alternate universe set in Edo period Japan, the Mikoshi (portable shrine) race is about to take place, the winner of which receives Beli1,000,000, and Boss Luffy and his friends recruit Franky to build them a mikoshi.",
    "releaseDate": "Sun, Jun 21, 2009",
    "releaseYear": 2009,
    "rating": 5.8
  },
  {
    "episode": 407,
    "title": "Jidaigeki Tokubetsu Hen: Yabure! Thriller Shoukai no Wana",
    "plot": "Robin reveals Brook's past to Luffy and his friends, and decide to help him. Brook is captured by Thriller LTD, but Luffy and Zoro arrive to help him escape.",
    "releaseDate": "Sun, Jun 28, 2009",
    "releaseYear": 2009,
    "rating": 5.8
  },
  {
    "episode": 280,
    "title": "Otoko no Ikizama! Zoro no Waza, Usopp no Yume",
    "plot": "A summary of Zoro and Usopp's backstory.",
    "releaseDate": "Sun, Oct 8, 2006",
    "releaseYear": 2006,
    "rating": 5.9
  },
  {
    "episode": 282,
    "title": "Wakare ga Otoko o Migaku! Sanji to Chopper",
    "plot": "A summary of Sanji and Chopper's backstory.",
    "releaseDate": "Sun, Oct 22, 2006",
    "releaseYear": 2006,
    "rating": 5.9
  },
  {
    "episode": 283,
    "title": "Subete wa Nakama no Tame ni! Yami no Naka no Robin!",
    "plot": "A summary of Robin's backstory, as well as the reasons of her recent actions.",
    "releaseDate": "Sun, Oct 29, 2006",
    "releaseYear": 2006,
    "rating": 5.9
  }
]